app/controllers/asss_controller.rb

  def index
  	@products = Product.where("categor = 'Ass'")
---
SELECT "products".* FROM "products"  WHERE (categor = 'Ass')