app/controllers/clasrolls_controller.rb

SELECT "products".* FROM "products"  WHERE (categor = 'Clas roll')
---
  def index
  	@products = Product.where("categor = 'Clas roll'")