app/controllers/coldrolls_controller.rb

SELECT "products".* FROM "products"  WHERE (categor = 'Cold roll')
---
  def index
  	@products = Product.where("categor = 'Cold roll'")