app/controllers/deserts_controller.rb

  def index
  	@products = Product.where("categor = 'Desert'")
---
SELECT "products".* FROM "products"  WHERE (categor = 'Desert')