app/controllers/dopkrolls_controller.rb

SELECT "products".* FROM "products"  WHERE (categor = 'Dop k roll')
---
  def index
  	@products = Product.where("categor = 'Dop k roll'")