app/controllers/exels_controller.rb

SELECT "products".* FROM "products"  WHERE (categor = 'Excl')
---
  def index
  	@products = Product.where("categor = 'Excl'")