app/controllers/firmrolls_controller.rb

  def index
  	@products = Product.where("categor = 'Firm roll'")
---
SELECT "products".* FROM "products"  WHERE (categor = 'Firm roll')