app/controllers/hotrolls_controller.rb

  def index
  	@products = Product.where("categor = 'Hot roll'")
---
SELECT "products".* FROM "products"  WHERE (catecor = Жареные Роллы)