app/controllers/naps_controller.rb

SELECT "products".* FROM "products"  WHERE (categor = 'Nap')
---
  def index
  	@products = Product.where("categor = 'Nap'")