app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-31 20:35:42.993221"], ["updated_at", "2015-05-31 20:35:42.993221"]]
INSERT INTO "orders" ("created_at", "name", "number", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-25 19:07:45.120127"], ["name", ""], ["number", ""], ["updated_at", "2015-05-25 19:07:45.120127"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 31]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])