app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = 6  [["price", 125.0], ["updated_at", "2015-05-31 18:33:55.797194"]]

def destroy
    @product = Product.where(:id => params[:id]).first
    @product.destroy
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = 6  ORDER BY "products"."id" ASC LIMIT 1
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 8]]