app/controllers/salats_controller.rb

  def index
  	@products = Product.where("categor = 'Salat'")
---
SELECT "products".* FROM "products"  WHERE (categor = 'Salat')