app/controllers/sushis_controller.rb

SELECT "products".* FROM "products"  WHERE (categor = 'Sushi')
---
  def index
  	@products = Product.where("categor = 'Sushi'")