app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    begin
      @user.destroy