app/controllers/zaprolls_controller.rb

  def index
  	@products = Product.where("categor = 'Zap roll'")
---
SELECT "products".* FROM "products"  WHERE (categor = 'Zap roll')